openwch/wch-usb-driver/chips/ch32v205/sdk/Peripheral/src/ch32v205_adc.c
    itmask = (uint8_t)(ADC_IT >> 8);
    ADCx->STATR = ~(uint32_t)itmask;
}

/*********************************************************************
 * @fn      TempSensor_Volt_To_Temper
 *
 * @brief   Internal Temperature Sensor Voltage to temperature.
 *
 * @param   Value - Voltage Value(mv).
 *
 * @return  Temper - Temperature Value.
 */
s32 TempSensor_Volt_To_Temper(s32 Value)
{
    s32 Temper, Refer_Volt, Refer_Temper;
    s32 k = 43;

    Refer_Volt = (s32)((TS_Val) & 0x0000FFFF);
    Refer_Temper = (s32)(((TS_Val) >> 16) & 0x0000FFFF);

    Temper = Refer_Temper - ((Value - Refer_Volt) * 10 + (k >> 1)) / k;

    return Temper;
}

/*********************************************************************
 * @fn      ADC_BufferCmd
 *
 * @brief   Enables or disables the ADCx buffer.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_BufferCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= (1 << 26);
    }
    else
    {
        ADCx->CTLR1 &= ~(1 << 26);
    }
}

/*********************************************************************
 * @fn      ADC_AnalogWatchdogResetCmd
 *
 * @brief   Enables or disables the analog watch dog reset function.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_AnalogWatchdogResetCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= (1 << 30);
    }
    else
    {
        ADCx->CTLR1 &= ~(1 << 30);
    }
}

/*********************************************************************
 * @fn      ADC_DisableAhandSwitchCmd
 *
 * @brief   Enables or disables the disable ahand switch function.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_DisableAhandSwitchCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= (1 << 31);
    }
    else
    {
        ADCx->CTLR1 &= ~(1 << 31);
    }
}

/*********************************************************************
 * @fn      ADC_DisableAhandSwitchCmd
 *
 * @brief   Enables or disables the increase the resistance of the sampling 
 *        switch resistor function.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_IncreaseSamplingResistanceCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR1 |= (1 << 29);
    }
    else
    {
        ADCx->CTLR1 &= ~(1 << 29);
    }
}

/*********************************************************************
 * @fn      ADC_ExternalTrigInjecConv_Ext_IT15_TKEY_OPA_Config
 *
 * @brief   Configures the ADCx external trigger for injected channels conversion.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_ExternalTrigInjecConv - specifies the ADC trigger to start
 *        injected conversion.
 *            ADC_ExternalTrigInjecConv_Ext_IT15_OPA - OPA or exti line 15 selected.
 *            ADC_ExternalTrigInjecConv_TKEY - Tkey selected.
 *
 * @return  none
 */
void ADC_ExternalTrigInjecConv_Ext_IT15_TKEY_OPA_Config(ADC_TypeDef *ADCx, uint32_t ADC_ExternalTrigInjecConv)
{
    uint32_t tmpreg = 0;

    tmpreg = ADCx->CTLR2;
    tmpreg &= ~(1 << 24);
    tmpreg |= ADC_ExternalTrigInjecConv;
    ADCx->CTLR2 = tmpreg;
}

/*********************************************************************
 * @fn      ADC_ADC_ExternalTrigRegConv_Ext_IT11_TKEY_OPA_Config
 *
 * @brief   Configures the ADCx external trigger for regular channels conversion.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          ADC_ExternalTrigRegConv - specifies the ADC trigger to start
 *        regular conversion.
 *            ADC_ExternalTrigRegConv_Ext_IT11_OPA - OPA or exti line 11 selected.
 *            ADC_ExternalTrigRegConv_TKEY - Tkey selected.
 *
 * @return  none
 */
void ADC_ADC_ExternalTrigRegConv_Ext_IT11_TKEY_OPA_Config(ADC_TypeDef *ADCx, uint32_t ADC_ExternalTrigRegConv)
{
    uint32_t tmpreg = 0;

    tmpreg = ADCx->CTLR2;
    tmpreg &= ~(1 << 25);
    tmpreg |= ADC_ExternalTrigRegConv;
    ADCx->CTLR2 = tmpreg;
}

/*********************************************************************
 * @fn      ADC_OPAPollTrigInjecConvCmd
 *
 * @brief   Enables or disables the OPA poll external trigger for injected 
 *        channels conversion function.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_OPAPollTrigInjecConvCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR2 |= (1 << 5);
    }
    else
    {
        ADCx->CTLR2 &= ~(1 << 5);
    }
}

/*********************************************************************
 * @fn      ADC_OPAPollTrigRegConvCmd
 *
 * @brief   Enables or disables the OPA poll external trigger for regular 
 *        channels conversion function.
 *
 * @param   ADCx - where x can be 1 to select the ADC peripheral.
 *          NewState - ENABLE or DISABLE.
 *
 * @return  none
 */
void ADC_OPAPollTrigRegConvCmd(ADC_TypeDef *ADCx, FunctionalState NewState)
{
    if(NewState != DISABLE)
    {
        ADCx->CTLR2 |= (1 << 4);
    }
    else
    {
        ADCx->CTLR2 &= ~(1 << 4);
    }
}
